Alright so I managed to create a functionapp,linux by: 
setting `azurerm_app_service_plan.kind` to Linux and `reserved` to true

but now I have a problem that every time I run apply it's trying to recreate the service plan just as mentioned in #5971 

```hcl
Terraform will perform the following actions:

  # module.factoryone_graphql_function.azurerm_app_service_plan.asp-factoryone must be replaced
-/+ resource "azurerm_app_service_plan" "xxxxxx" {
      ~ id                           = "/subscriptions/xxxxx/resourceGroups/xxxxxx-staging/providers/Microsoft.Web/serverfarms/xxxxxxxx" -> (known after apply)
      - is_xenon                     = false -> null
      ~ kind                         = "functionapp" -> "Linux" # forces replacement
        location                     = "westeurope"
        reserved                     = true
        ....

      ~ sku {
          ~ capacity = 0 -> (known after apply)
            size     = "Y1"
            tier     = "Dynamic"
        }

        timeouts {}
    }

  # module.xxxxxx.azurerm_function_app.xxxxxxx will be updated in-place
  ~ resource "azurerm_function_app" "xxxxx" {
      ~ app_service_plan_id            = "/subscriptions/xxxxxxx/resourceGroups/factory-one-staging/providers/Microsoft.Web/serverfarms/xxxxxx" -> (known after apply)
        app_settings                   = {
            "APPINSIGHTS_INSTRUMENTATIONKEY" = ""
            "FUNCTIONS_WORKER_RUNTIME"       = "node"
            "WEBSITE_NODE_DEFAULT_VERSION"   = "10.4.1"
            "WEBSITE_RUN_FROM_PACKAGE"       = ""
        }
        kind                           = "functionapp,linux"
        location                       = "westeurope"
        os_type                        = "linux"
        version                        = "~2"
        ....
        }
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```
